# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(name)


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    num = len(name)
    print(f'{name} : {num}')


# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    if is_male[name]:
        print(f'{name} : Муж.')
    else:
        print(f'{name} : Жен.')


# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]
sort_group = []
all_group = len(groups)
sort_group.append(f'Всего группы {all_group}')
for num, group in enumerate(groups, start=1):
    num_student = len(group)
    sort_group.append(f'Группа {num} : {num_student} ученика.')
print(*sort_group, sep='\n')       
        


# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
list_group = []
list_students = []
for num, group in enumerate(groups, start=1):
    list_group.append(f'Группа {num}: ')
    student = [i for i in group]
    list_students.append(student)
for i in range(len(groups)):
    list_students[i] = ', '.join(list_students[i])
    print(f'{list_group[i]}{list_students[i]}')

